[
  { "riddle": "What goes up and never comes down?", "answer": "age" },
  { "riddle": "What word contains all of the twenty six letters?", "answer": "alphabet" },
  { "riddle": "I have many feathers to help me fly. I have a body and head, but I'm not alive. It is your strength which determines how far I go. You can hold me in your hand, but I'm never thrown. What am I?", "answer": "arrow" },
  { "riddle": "I can be created by humans, but they cannot control me. I suck on wood, paper and flesh alike. I can be more of a hindrance than help. To my creators, I seem to be everywhere at once.  What am I?", "answer": "baby" },
  { "riddle": "Three men were walking out one day. Then it started raining hard. They raced 4 blocks to there house. When they got in, one man didnt get his hair wet. They did not have an umbrella, or a hat. How can this be?", "answer": "bald" },
  { "riddle": "You hear it speak, for it has a hard tongue. But it cannot breathe, for it has no lung. What is it?", "answer": "bell" },
  { "riddle": "If you are a velophile, what is it that you love?", "answer": "bicycle" },
  { "riddle": "Dark with white markings, smooth like a rock. Where learning occurs, I help convey thought. What am I?", "answer": "blackboard" },
  { "riddle": "I'm so fast you can't see me. Though everyone sees straight through me. I don't stop until the day you die. What am I?", "answer": "blink" },
  { "riddle": "I have no voice and yet I speak to you. I tell of all things in the world that people do. I have leaves, but I am not a tre. I have pages, but I am not a bride or royalty. I have a spine and hinges, but I am not a man or a door. I have told you all, I cannot tell you more. What am I?", "answer": "book" },
  { "riddle": "Dead on the field lie ten soldiers in white, felled by three eyes, black as night. Where am I?", "answer": "bowling alley" },
  { "riddle": "What word starting with BR, that with the addition of the letter E, becomes another word that sounds the same as the first?", "answer": "braking" },
  { "riddle": "This is as light as a feather, Yet no man can hold it for long. What is it?", "answer": "breath" },
  { "riddle": "A very pretty thing am I, fluttering in the pale-blue sky. Delicate, fragile on the wing, indeed I am a pretty thing.  What am I?", "answer": "butterfly" },
  { "riddle": "My life can be measured in hours. I serve by being devoured. Thin, I am quick. Fat, I am slow. Wind is my foe. What am I?", "answer": "candle" },
  { "riddle": "When I am young I am tall. When I am old I am short.  What can I be?", "answer": "candle" },
  { "riddle": "What is black when clean and white when dirty?", "answer": "chalkboard" },
  { "riddle": "I am like day,  you can find me near the river any day,  and you can make almost anything out of me.  who am I?", "answer": "clay" },
  { "riddle": "I fly, yet I have no wings. I cry, yet I have no eyes. Darkness follows me; lower light I never see.", "answer": "cloud" },
  { "riddle": "A little pool with two layers of wall around it. One white and soft and the other dark and hard, amidst a light brown grassy lawn with an outline of a green grass. What am I?", "answer": "coconut" },
  { "riddle": "The man who made it doesn't want it. The man who bought it doesn't need it. The man who has it can't see it. What is it???", "answer": "coffin" },
  { "riddle": "What can you catch but not throw?", "answer": "cold" },
  { "riddle": "You pick it, You peel the outside, You cook the inside, You eat the outside, And throw away the inside.  What am I?", "answer": "corn" },
  { "riddle": "Whoever makes it, tells it not. Whoever takes it, knows it not. And whoever knows it wants it not.", "answer": "counterfeit money" },
  { "riddle": "The more there is the less you see.  What is it?", "answer": "darkness" },
  { "riddle": "A father's child, a mother's child, yet no one's son. Who am I?", "answer": "daughter" },
  { "riddle": "David's father has three sons: Snap, Krackel, and who else?", "answer": "david" },
  { "riddle": "A hundred feet in the air, but its back is on the ground. What is it?", "answer": "dead centipede" },
  { "riddle": "Some try to hide, some try to cheat, but time will show, we always will meet. Try as you might, to guess my name, I promise you'll know, when you I do claim. Who am I?", "answer": "death" },
  { "riddle": "I dig out tiny caves, and store gold and silver in them. I also build bridges of silver and make crowns of gold. They are the smallest you could imagine. Sooner or later everybody needs my help, yet many people are afraid to let me help them. Who am I?", "answer": "dentist" },
  { "riddle": "Here on Earth it's always true, that a day follows a day. But there is a place where yesterday always follows today!", "answer": "dictionary" },
  { "riddle": "The answer I give is yes, but what I mean is no. What was the question?", "answer": "do you mind" },
  { "riddle": "Hands she has but does not hold. Teeth she has but does not bite. Feet she has but they are cold. Eyes she has but without sight. Who is she?", "answer": "doll" },
  { "riddle": "My voice rises above the din, Sometimes catching all unaware. I never ask questions, yet get many answers.", "answer": "doorbell" },
  { "riddle": "What has no beginning, end, or middle?", "answer": "doughnut" },
  { "riddle": "I am six letters. When you take one away I am twelve. What am I?", "answer": "dozens" },
  { "riddle": "I come at the end of time and at the start of eternity. I come four times in every week, but only once in a thousand years. What am I?", "answer": "e" },
  { "riddle": "You heard me before, Yet you hear me again, Then I die, 'Till you call me again.", "answer": "echo" },
  { "riddle": "What is more useful when it is broken?", "answer": "egg" },
  { "riddle": "Pronounced as one letter, and written with three. Two letters there are, and two only in me. I'm double, I'm single, I'm black, blue, and gray. I'm read from both ends, and the same either way. What am I?", "answer": "eye" },
  { "riddle": "Who are the two brothers who live on opposite sides of the road yet never see each other?", "answer": "eyes" },
  { "riddle": "I make you weak at the worst of all times. I keep you safe, I keep you fine. I make your hands sweat, and your heart grow cold, I visit the weak, but seldom the bold. What am I?", "answer": "fears" },
  { "riddle": "They can trickle down, They can tickle too. Or make you sneeze, Or comfort you. Their rustling sound, you've rarely heard, Unless you're a pillow or a bird!  What are they?", "answer": "feathers" },
  { "riddle": "I know a word of letters three. Add two, and fewer there will be.", "answer": "few" },
  { "riddle": "I can be long, or I can be short. I can be grown, and I can be bought. I can be painted, or left bare. I can be round, or square. What am I?", "answer": "fingernails" },
  { "riddle": "If life gets tough, what do you have that you can always count on?", "answer": "fingers" },
  { "riddle": "No legs have I to dance. No lungs have I to breathe. No life have I to live or die. And yet I do all three. What am I?", "answer": "fire" },
  { "riddle": "When they are caught, they are thrown away. When they escape, you itch all day. What are they?", "answer": "fleas" },
  { "riddle": "Who spends the day at the window, goes to the table for meals and hides at night?", "answer": "fly" },
  { "riddle": "The more you take, the more you leave behind. What are they?", "answer": "footprints" },
  { "riddle": "My first is in fish but not in snail, My second is in rabbit but not in tail. My third is in up but not in down, My fourth is in tiara but not in crown. My fifth is in tree you plainly see, My whole a food for you and me. What am I?", "answer": "fruit" },
  { "riddle": "What has garbage and flies?", "answer": "garbage truck" },
  { "riddle": "A blue house is made of blue bricks. A yellow house is made of yellow bricks. A red house is made of red bricks. An orange house is made of orange bricks. What would a green house be made of?", "answer": "glass" },
  { "riddle": "They have not flesh, nor feathers, nor scales, nor bone. Yet they have fingers and thumbs of their own. What are they?", "answer": "gloves" },
  { "riddle": "What sport has four letters, is played all around the world, and begins with a T?", "answer": "golf" },
  { "riddle": "The sun bakes them, the hand breaks them, the foot treads on them, and the mouth tastes them. What are they?", "answer": "grapes" },
  { "riddle": "I am a tree, but I am very small... Who am I?", "answer": "grass" },
  { "riddle": "What stays where it is when it goes off?", "answer": "gun" },
  { "riddle": "How far can a dog run into the woods?", "answer": "halfway" },
  { "riddle": "What do you use to hoe a row, slay a foe, and wring with woe?", "answer": "hands" },
  { "riddle": "Inside a burning house, this thing is best to make. And best to make it quickly, before the fire's too much to take!", "answer": "haste" },
  { "riddle": "I can flutter and take your breath away. I can take a beating, but do not bruise. If I stopped you would be sure to lose. Everyday I am with you. What am I?", "answer": "heart" },
  { "riddle": "There is a word in the English language in which the first two letters signify a male, the first three letters signify a female, the first four signify a great man, and the whole word, a great woman. What is the word?", "answer": "heroine" },
  { "riddle": "I am weightless, but you can see me. Put me in a bucket, and I'll make it lighter. What am I?", "answer": "hole" },
  { "riddle": "When you stop and look, you can always see me. If you try to touch you cannot feel me. I cannot move, but as you near me, I will move away from you. What am I?", "answer": "horizon" },
  { "riddle": "What always goes to bed with shoes on?", "answer": "horse" },
  { "riddle": "I have an eye but cannot see. I am stronger and faster then any man alive but have no limbs. What am I?", "answer": "hurricane" },
  { "riddle": "I am the shortest complete sentence in the English language. What am I?", "answer": "i am" },
  { "riddle": "Lighter than what I am made of. More of me is hidden than seen. What am I?", "answer": "iceberg" },
  { "riddle": "I soar without wings, I see without eyes. I've traveled the universe to and fro. I've conquered the world, yet I've never been anywhere but home. Who am I?", "answer": "imagination" },
  { "riddle": "I can be cracked, I can be made. I can be told, I can be played. What am I?", "answer": "joke" },
  { "riddle": "What force and strength cannot get through, I with a gentle touch can do. And many in the street would stand, were I not a friend in hand.", "answer": "key" },
  { "riddle": "What object has keys that open no locks, space but no room, and you can enter but not go in?", "answer": "keyboard" },
  { "riddle": "Some will use me, while others will not, some have remembered, while others have forgot. For profit or gain, I'm used expertly, I can't be picked off the ground or tossed into the sea. Only gained from patience and time, can you unravel my rhyme?", "answer": "knowledge" },
  { "riddle": "The Pope has it but he does not use it. Your father has it but your mother uses it. Nuns do not need it. Your lady friend's husband has it and she uses it. What is it?", "answer": "last name" },
  { "riddle": "You do not want to have it, But when you do have it, You do not want to lose it? What is it?", "answer": "lawsuit" },
  { "riddle": "I am taken from a mine, and shut up in a wooden case, from which I am never released, and yet I am used by almost everybody.", "answer": "lead" },
  { "riddle": "Walk on the living, they don't even mumble. Walk on the dead, they mutter and grumble. What are they?", "answer": "leaves" },
  { "riddle": "When I point up it's bright, but when I point down it's dark. What am I?", "answer": "light switch" },
  { "riddle": "What goes into the water black and comes out red?", "answer": "lobster" },
  { "riddle": "What two things can you never eat for breakfast?", "answer": "lunch, dinner" },
  { "riddle": "What is once in a minute, twice in a moment, and never in a thousand years?", "answer": "m" },
  { "riddle": "It walks on four legs in the morning, two legs at noon and three legs in the evening. What is it", "answer": "man" },
  { "riddle": "Where will you find roads without cars, forests without trees and cities without houses?", "answer": "map" },
  { "riddle": "Take one out and scratch my head, I am now black but once was red. What am I ?", "answer": "match" },
  { "riddle": "What can bring back the dead; make us cry, make us laugh, make us young; born in an instant yet lasts a life time?", "answer": "memories" },
  { "riddle": "The higher I climb, the hotter I engage, I can not escape my crystal cage. What am I?", "answer": "mercury" },
  { "riddle": "I say everything I hear to others around. I'm not an animal, nor part of the human race. I will, immediately, repeat after you; But only if my tail is in place. What am I?", "answer": "microphone" },
  { "riddle": "I give milk and have a horn but I'm not a cow? What am I?", "answer": "milk truck" },
  { "riddle": "A man but an animal, a horn with two hands. What am I?", "answer": "minotaur" },
  { "riddle": "What is it that is deaf, dumb and blind and always tells the truth?", "answer": "mirror" },
  { "riddle": "One word in this sentence is misspelled. What word is it?", "answer": "misspelled" },
  { "riddle": "It's been around for millions of years, but it's no more than a month old. What is it?", "answer": "moon" },
  { "riddle": "I'm related to you. I'm really close to you!  I'm your cousins aunt. Who am I?", "answer": "mother" },
  { "riddle": "A man is late for an appointment and, in his haste, takes a corner so fast that only two wheels were on the pavement. A police man is standing on the corner, but he did not give him a ticket. Why?", "answer": "motorcycle" },
  { "riddle": "It has roots that nobody sees, and is taller than trees. Up, up it goes, and yet it never grows. What is it?", "answer": "mountain" },
  { "riddle": "You can carry it everywhere you go, and it does not get heavy. What is it?", "answer": "name" },
  { "riddle": "What falls but doesn't break, and what breaks but doesn't fall?", "answer": "night and day" },
  { "riddle": "What is that which goes with a carriage, comes with a carriage, is of no use to a carriage, and yet the carriage cannot go without it?", "answer": "noise" },
  { "riddle": "Where on Earth do the winds always blow from the South?", "answer": "north pole" },
  { "riddle": "The rich need it.  The poor have it.  If you eat it, you will die.  Who am I?", "answer": "nothing" },
  { "riddle": "What is round on the ends and high in the middle?", "answer": "ohio" },
  { "riddle": "I am the fountain from which no one can drink. For many I am considered a necessary link. Like gold to all I am sought for, But my continued death brings wealth for all to want more. What am I?", "answer": "oil" },
  { "riddle": "You use a knife to slice my head and weep beside me when I am dead. What am I?", "answer": "onion" },
  { "riddle": "What part of the turkey has the most feathers?", "answer": "outside" },
  { "riddle": "What kind of coat can be put on only when wet?", "answer": "paint" },
  { "riddle": "Two men are in a desert. They both have packs on. One of the guys is dead. The guy who is alive has his pack open. The guy who is dead has his pack closed. What is in the pack?", "answer": "parachute" },
  { "riddle": "The strangest creature you'll ever find: Two eyes in front and more behind.", "answer": "peacock" },
  { "riddle": "What kind of can never needs a can-opener?", "answer": "pelican" },
  { "riddle": "What has a head, a tail, is brown, and has no legs?", "answer": "penny" },
  { "riddle": "Some say we are red, some say we are green. Some play us, some spray us. What are we?", "answer": "pepper" },
  { "riddle": "What demands an answer, but asks no question?", "answer": "phone" },
  { "riddle": "I am a box that holds keys without locks, yet they can unlock your soul.  What am I?", "answer": "piano" },
  { "riddle": "I was framed, yet I didn't commit a crime, and the person who framed me committed no crime.  What am I?", "answer": "picture" },
  { "riddle": "What stinks while living, but in death, smells good?", "answer": "pig" },
  { "riddle": "What is put on a table, cut, but never eaten?", "answer": "playing cards" },
  { "riddle": "What goes into the water red and comes out black?", "answer": "poker" },
  { "riddle": "What is brown and sticky and goes round and round", "answer": "poo" },
  { "riddle": "He has married many women, but has never been married. Who is he?", "answer": "preacher" },
  { "riddle": "What can be swallowed, but can also swallow you?", "answer": "pride" },
  { "riddle": "What is it that you ought to keep after you have given it to someone else?", "answer": "promise" },
  { "riddle": "A cloud was my mother, the wind is my father, my son is the cool stream, and my daughter is the fruit of the land. A rainbow is my bed, the earth my final resting place, and I'm the torment of man.", "answer": "rain" },
  { "riddle": "What is red and blue, and purple and green? No one can reach it, not even the queen?", "answer": "rainbow" },
  { "riddle": "You can see nothing else When you look in my face, I will look you in the eye And I will never lie.", "answer": "reflection" },
  { "riddle": "What can be heard and caught but never seen?", "answer": "remark" },
  { "riddle": "When one does not know what it is, then it is something; but when one knows what it is, then it is nothing.", "answer": "riddle" },
  { "riddle": "What can run but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps?", "answer": "river" },
  { "riddle": "I am the beginning of sorrow, and the end of sickness. You cannot express happiness without me, yet I am in the midst of crosses. I am always in risk, yet never in danger. You may find me in the sun, but I am never out of darkness.", "answer": "s" },
  { "riddle": "What can burn the eyes, sting the mouth, yet be consumed?", "answer": "salt" },
  { "riddle": "As I went across the bridge, I met a man with a load of wood which was neither straight nor crooked. What kind of wood was it?", "answer": "sawdust" },
  { "riddle": "I can be found on a human or beast all people should have one at least I can be any shape or any size and my history you'll despise  What Am I?", "answer": "scar" },
  { "riddle": "Poke your fingers in my eyes and I will open wide my jaws. Linen cloth, quills, or paper, my greedy lust devours them all.", "answer": "scissors" },
  { "riddle": "What never gets any wetter, no matter how much it rains?", "answer": "sea" },
  { "riddle": "It goes up, but at the same time goes down. Up toward the sky, and down toward the ground. It's present tense and past tense too, come for a ride, just me and you.  What is it?", "answer": "see-saw" },
  { "riddle": "I'm the part of the bird that's not in the sky. I can swim in the ocean and yet remain dry. What am I?", "answer": "shadow" },
  { "riddle": "Weight in my belly, Trees on my back. Nails in my ribs, Feet I do lack.", "answer": "ship" },
  { "riddle": "Which word in the English language becomes shorter when it is lengthened?", "answer": "short" },
  { "riddle": "People walk on me day and night. I never sleep. Who am I?", "answer": "sidewalk" },
  { "riddle": "What is round as a dishpan, deep as a tub, and still the oceans couldn't fill it up?", "answer": "sieve" },
  { "riddle": "What is so fragile that when you say its name you break it?", "answer": "silence" },
  { "riddle": "You give someone a dollar. You are this person's brother, but the person is not your brother. Who is it?", "answer": "sister" },
  { "riddle": "I am the black child of a white father, a wingless bird, flying even to the clouds of heaven. I give birth to tears of mourning in pupils that meet me, even though there is no cause for grief, and at once on my birth I am dissolved into air.  Who am I?", "answer": "smoke" },
  { "riddle": "If a man carried my burden he would break his back. I am not big but leave silver in my tracks. What am I?", "answer": "snail" },
  { "riddle": "I have no legs or arms but I still eat with a fork everyday, What am I?", "answer": "snake" },
  { "riddle": "You use it between your head and your toes, the more it works the thinner it grows. What is it?", "answer": "soap" },
  { "riddle": "I am only useful when I am full. Yet I am always full of holes.", "answer": "sponge" },
  { "riddle": "As a whole, I am both safe and secure. Behead me, and I become a place of meeting. Behead me again, and I am the partner of ready. Restore me, and I become the domain of beasts. What am I?", "answer": "stable" },
  { "riddle": "I GO UP AND DOWN.... BUT NEVER MOVE. WHO AM I?", "answer": "stairs" },
  { "riddle": "What goes around the world and stays in a corner?", "answer": "stamp" },
  { "riddle": "With pointed fangs it sits in wait. With piercing force its doles out fate. Over bloodless victims proclaiming its might. Eternally joining in a single bite. What am I?", "answer": "stapler" },
  { "riddle": "At night they come without being fetched, And by day they are lost without being stolen.", "answer": "stars" },
  { "riddle": "I'm not really more than holes tied to more holes; I'm strong as good steel, though not as stiff as a pole. What am I?", "answer": "steel chain" },
  { "riddle": "Big as a biscuit, deep as a cup, even a river can't fill it up. What is it?", "answer": "strainer" },
  { "riddle": "On a fine sunny day a ship was in the harbor. All of a sudden the ship began to sink. There was no storm and nothing wrong with the ship yet it sank right in front of the spectators eyes. What caused the ship to sink?", "answer": "submarine" },
  { "riddle": "A certain crime is punishable if attempted but not punishable if committed. What is it?", "answer": "suicide" },
  { "riddle": "What goes through the door without pinching itself? What sits on the stove without burning itself? What sits on the table and is not ashamed?", "answer": "sun" },
  { "riddle": "Never resting, never still. Moving silently from hill to hill. It does not walk, run or trot, All is cool where it is not.  What is it?", "answer": "sunshine" },
  { "riddle": "What starts with a T, ends with a T, and has T in it?", "answer": "teapot" },
  { "riddle": "You must keep this thing. Its loss will affect your brothers. For once yours is lost: it will soon be lost by others.", "answer": "temper" },
  { "riddle": "What can go up and come down without moving?", "answer": "temperature" },
  { "riddle": "What do you serve that you can't eat?", "answer": "tennis ball" },
  { "riddle": "It runs and runs but can never flee. It is often watched, yet never sees. When long it brings boredom, When short it brings fear. What is it?", "answer": "time" },
  { "riddle": "What kind of rocks does Frankenstein have in his collection?", "answer": "tombstones" },
  { "riddle": "I never was, am always to be. No one ever saw me, nor ever will. And yet I am the confidence of all. To live and breathe on this terrestrial ball. What am I?", "answer": "tomorrow" },
  { "riddle": "What gets wetter the more it dries?", "answer": "towel" },
  { "riddle": "What has no heart Yet is alive? It never moves People stab it with knives.", "answer": "tree" },
  { "riddle": "Who is it that rows quickly with four oars but never comes out from under his own roof?", "answer": "turtle" },
  { "riddle": "If you have three oranges and you take away two, how many will you have?", "answer": "two" },
  { "riddle": "What can go up a chimney down, but cannot go down a chimney up?", "answer": "umbrella" },
  { "riddle": "I have a big mouth and I am also quite loud! I am NOT a gossip but I do get involved with everyone's dirty business. Can you name me?", "answer": "vacuum cleaner" },
  { "riddle": "My voice is tender, my waist is slender and I'm often invited to play. Yet wherever I go I must take my bow or else I have nothing to say. What am I?", "answer": "violin" },
  { "riddle": "My thunder comes before the lightning; My lightning comes before the clouds; My rain dries all the land it touches. What am I?", "answer": "volcano" },
  { "riddle": "We are little creatures; all of us have different features. One of us in glass is set; one of us you'll find in jet. Another you may see in tin, and the fourth is boxed within . If the fifth you should pursue, it can never fly from you. What are we?", "answer": "vowels" },
  { "riddle": "Three lives have I. Gentle enough to soothe the skin. Light enough to caress the sky. Hard enough to crack rocks. What am I?", "answer": "water" },
  { "riddle": "This old one runs forever, but never moves at all. He has not lungs nor throat, but still a mighty roaring call. What is it?", "answer": "waterfall" },
  { "riddle": "There was a green house. Inside the green house there was a white house Inside the white house there was a red house. Inside the red house there were lots of babies.", "answer": "watermelon" },
  { "riddle": "What fastens two people yet touches only one?", "answer": "wedding ring" },
  { "riddle": "If you drop a yellow hat in the Red Sea, what does it become?", "answer": "wet" },
  { "riddle": "I have two arms, but fingers none. I have two feet, but cannot run. I carry well, but I have found: I carry best with my feet OFF the ground. What am I?", "answer": "wheelbarrow" },
  { "riddle": "What is it that when you take away the whole, you still have some left over?", "answer": "wholesome" },
  { "riddle": "All about, but cannot be seen, Can be captured, cannot be held, No throat, but can be heard. What is it?", "answer": "wind" },
  { "riddle": "I have four wings, but cannot fly, I never laugh and never cry; On the same spot I'm always found, toiling away with little sound. What am I?", "answer": "windmill" },
  { "riddle": "Almost everyone sees me without noticing me, For what is beyond is what he or she seeks. What am I?", "answer": "window" },
  { "riddle": "You can't keep this until you have given it.", "answer": "word" },
  { "riddle": "Two words, my answer is only two words. To keep me, you must give me.", "answer": "your word" }
]
